podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/1.stage1Folder/peripherals/PDB0_MKE15Z7.svd.xml
            <register>
               <name>CH1C1</name>
               <description>Channel n Control register 1</description>
               <addressOffset>0x38</addressOffset>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>PDB Channel Pre-Trigger Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB channel&apos;s corresponding pre-trigger disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB channel&apos;s corresponding pre-trigger enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TOS</name>
                     <description>PDB Channel Pre-Trigger Output Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB channel&apos;s corresponding pre-trigger is in bypassed mode. The pre-trigger asserts one peripheral clock cycle after a rising edge is detected on selected trigger input source or software trigger is selected and SWTRIG is written with 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB channel&apos;s corresponding pre-trigger asserts when the counter reaches the channel delay register and one peripheral clock cycle after a rising edge is detected on selected trigger input source or software trigger is selected and SETRIG is written with 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BB</name>
                     <description>PDB Channel Pre-Trigger Back-to-Back Operation Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB channel&apos;s corresponding pre-trigger back-to-back operation disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB channel&apos;s corresponding pre-trigger back-to-back operation enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH0S</name>
               <description>Channel n Status register</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>PDB Channel Sequence Error Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Sequence error not detected on PDB channel&apos;s corresponding pre-trigger</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Sequence error detected on PDB channel&apos;s corresponding pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from PDB channel n. When one conversion, which is triggered by one of the pre-triggers from PDB channel n, is in progress, new trigger from PDB channel&apos;s corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is set. Writing 0&apos;s to clear the sequence error flags</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CF</name>
                     <description>PDB Channel Flags</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH1S</name>
               <description>Channel n Status register</description>
               <addressOffset>0x3C</addressOffset>
               <fields>
                  <field>
                     <name>ERR</name>
                     <description>PDB Channel Sequence Error Flags</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Sequence error not detected on PDB channel&apos;s corresponding pre-trigger</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Sequence error detected on PDB channel&apos;s corresponding pre-trigger. ADCn block can be triggered for a conversion by one pre-trigger from PDB channel n. When one conversion, which is triggered by one of the pre-triggers from PDB channel n, is in progress, new trigger from PDB channel&apos;s corresponding pre-trigger m cannot be accepted by ADCn, and ERR[m] is set. Writing 0&apos;s to clear the sequence error flags</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CF</name>
                     <description>PDB Channel Flags</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH0DLY0</name>
               <description>Channel n Delay 0 register</description>
               <addressOffset>0x18</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>PDB Channel Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH1DLY0</name>
               <description>Channel n Delay 0 register</description>
               <addressOffset>0x40</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>PDB Channel Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH0DLY1</name>
               <description>Channel n Delay 1 register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>PDB Channel Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CH1DLY1</name>
               <description>Channel n Delay 1 register</description>
               <addressOffset>0x44</addressOffset>
               <fields>
                  <field>
                     <name>DLY</name>
                     <description>PDB Channel Delay</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>POEN</name>
               <description>Pulse-Out n Enable register</description>
               <addressOffset>0x190</addressOffset>
               <fields>
                  <field>
                     <name>POEN</name>
                     <description>PDB Pulse-Out Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PDB Pulse-Out disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PDB Pulse-Out enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PO0DLY</name>
               <description>Pulse-Out n Delay register</description>
               <addressOffset>0x194</addressOffset>
               <fields>
                  <field>
                     <name>DLY2</name>
                     <description>PDB Pulse-Out Delay 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DLY1</name>
                     <description>PDB Pulse-Out Delay 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PO1DLY</name>
               <description>Pulse-Out n Delay register</description>
               <addressOffset>0x198</addressOffset>
               <fields>
                  <field>
                     <name>DLY2</name>
                     <description>PDB Pulse-Out Delay 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>DLY1</name>
                     <description>PDB Pulse-Out Delay 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
